ai-cgs/causality.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-02 Thu 19:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Causality</title>
<meta name="author" content="shubhamkar" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8 h">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="../others.css">

<link rel='stylesheet' href='styles.css'>
<link rel='stylesheet' type='text/css' href='https://fonts.googleapis.com/css?family=Droid+Sans' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Causality</h1>
<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> <a href="shared-attention.html">Shared Attention and Theory of Mind</a> | <b>Next:</b> None
</p>
</div>

<p>
There is an idea that thinking is acting in an imagined space. To do so, we need models of the world - a simplification or abstraction of the world. By definition, models cannot capture everything about the world. However, as an organism or a system gains more experience, or as its goals or environment change, it has the opportunity to augment its models.
</p>

<p>
Thus, in the long run, certain models which allow the system to reuse its past knowledge are better than other models which make augmentations difficult. It turns out that models which incorporate causality are actually amongst such good models (See section 1.3 of version 2 of <a href="http://bayes.cs.ucla.edu/BOOK-2K/">this book</a>.).
</p>

<p>
In fact, causal models have the potential to address issues related to transfer learning and out-of-distribution generalization that have been picking up pace in the machine learning community over the last decade. (See <a href="https://ieeexplore.ieee.org/abstract/document/9363924/">this paper</a>.) However, most research on causality either involves the causal models or at least the variables being given apriori. It is unclear how such variables may be discovered from high dimensional data. It should certainly be possible, since humans as well as non-human animals seem to be able to do it quite well.
</p>

<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> <a href="shared-attention.html">Shared Attention and Theory of Mind</a> | <b>Next:</b> None
</p>
</div>
</div>
</body>
</html>
